## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.tls will be created
+   resource "kubernetes_secret" "tls" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-com-cinema-tls"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # tls_cert_request.request will be created
+   resource "tls_cert_request" "request" {
+       cert_request_pem = (known after apply)
+       id               = (known after apply)
+       key_algorithm    = (known after apply)
+       private_key_pem  = (sensitive value)

+       subject {
+           common_name  = "wayofthesys.com"
+           organization = "WayOfTheSys"
        }
    }

  # tls_locally_signed_cert.cert will be created
+   resource "tls_locally_signed_cert" "cert" {
+       allowed_uses          = [
+           "cert_signing",
+           "client_auth",
+           "digital_signature",
+           "key_encipherment",
+           "server_auth",
        ]
+       ca_cert_pem           = (known after apply)
+       ca_key_algorithm      = (known after apply)
+       ca_private_key_pem    = (sensitive value)
+       cert_pem              = (known after apply)
+       cert_request_pem      = (known after apply)
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = false
+       ready_for_renewal     = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)
    }

  # tls_private_key.key is tainted, so must be replaced
-/+ resource "tls_private_key" "key" {
!       id                            = "30d3970e917f2007fcffd5f1cdd308d913c53dd7" -> (known after apply)
!       private_key_openssh           = (sensitive value)
!       private_key_pem               = (sensitive value)
!       private_key_pem_pkcs8         = (sensitive value)
!       public_key_fingerprint_md5    = "cb:fb:69:a0:b8:d3:51:c7:c6:17:5a:f8:45:48:8c:2a" -> (known after apply)
!       public_key_fingerprint_sha256 = "SHA256:FJXzfl1nhV8rdONuaBXvkGpUKRrlDd4r/IixJqLjUkQ" -> (known after apply)
!       public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDrGSjO0OR8kHgUTqhKq0+DMJ4Y+Vxxz0yfGuS++5u2XGKWjYoeHmx+hNZOAEuKh+hvcCMogh/tA9jAOufCDS0fhgJ0Ni6otmkzFW4WrZAH66ZnHgn/193kKoKtqddr0vxdEwMNg665TS3aJFZz0RRxvgtdyMaz6kl0inqkEC6gD39fI3HkQcu7/MV17Y7/KMfRNojlk0oyorqMr+RaY3MeKimJeDuMJscpmR3B3OB3XBAiZUNl+8CQF+CWdBIU7QaHOtcDtCH0CYSNIPHGMlnM48ETZMKZliVt8mpHl0zMDUCYp0MBT/eQ0TsDK3CjBBdpJyCPJmRIMJqroRJMA28v
        EOT -> (known after apply)
!       public_key_pem                = <<-EOT
-            ----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA6xkoztDkfJB4FE6oSqtP
            gzCeGPlccc9Mnxrkvvubtlxilo2KHh5sfoTWTgBLiofob3AjKIIf7QPYwDrnwg0t
            H4YCdDYuqLZpMxVuFq2QB+umZx4J/9fd5CqCranXa9L8XRMDDYOuuU0t2iRWc9EU
            cb4LXcjGs+pJdIp6pBAuoA9/XyNx5EHLu/zFde2O/yjH0TaI5ZNKMqK6jK/kWmNz
            HiopiXg7jCbHKZkdwdzgd1wQImVDZfvAkBfglnQSFO0GhzrXA7Qh9AmEjSDxxjJZ
            zOPBE2TCmZYlbfJqR5dMzA1AmKdDAU/3kNE7AytwowQXaScgjyZkSDCaq6ESTANv
            LwIDAQAB
-            ----END PUBLIC KEY-----
        EOT -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # tls_self_signed_cert.ca is tainted, so must be replaced
-/+ resource "tls_self_signed_cert" "ca" {
!       cert_pem              = <<-EOT
-            ----BEGIN CERTIFICATE-----
            MIIDHzCCAgegAwIBAgIRAN4Nt0h8FfVRguUb81DH+pYwDQYJKoZIhvcNAQELBQAw
            KTEUMBIGA1UEChMLV2F5T2ZUaGVTeXMxETAPBgNVBAMTCGNhLmxvY2FsMB4XDTIy
            MTAxNTAyMjE0NVoXDTIzMTAxNTAyMjE0NVowKTEUMBIGA1UEChMLV2F5T2ZUaGVT
            eXMxETAPBgNVBAMTCGNhLmxvY2FsMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
            CgKCAQEA93GhRpkrtsfV/QNBRGkGYohL9zOdIqTgzXi2dTT0cZvRsQBJGyJObIxy
            1IRgOgfmlhwzRCOH8/3upBoZ5kLJEuSW+hgqTXhGzpQmR4ofxfjoGyfyYSz4Xj4D
            0DD0uBvhReXFZSdEU6uEYwde4EUOlgaj7uEYdeTHU2a/amLAszmOzZ4Z7E1uiNLZ
            WRFDfjCTWfaLHFcsgkGhINrJ1n6rgsYWPYJN8Y7m3Rm6Bp1DOy1RkPNuji+dIT27
            DoXMZNpg96xmuIswgL7nvvkJ/zWUHoeMllbgXtfBbOYrsFLgvt87+vC3f5tq7Tab
            lUjXuFB1QwwZqofrIYSb4Tl5pywAIQIDAQABo0IwQDAOBgNVHQ8BAf8EBAMCAqQw
            DwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUkuEbFxOBP+wAWVviEAGc9brjrhAw
            DQYJKoZIhvcNAQELBQADggEBAFQon7jQSMxzM9duYZNRuv3aK19Ljto1QywfXRPs
            OK0yrUW3u/vr2gzybT14G7PxP2JPhmERnD7okz5Pm9VnYUQvlWVYbQuAM5mcRBEl
            NmwJBEBtGGN3dGWG4/6BmMGQHSfE2qG2dB5CXZaoTvGhoTghacWi/YpyCqoR2CvL
            uQOZXhooR0NxoQwVz2sp/rm3uq2Rd5YV+sFT4OEYQGN81tddOqfhEAMJ2olYzLu2
            H9doOQ9Fl9AxO8ba2EEJYLeu6zpDpWmgc1YEL09QAVpSUa/fuplnGQjV5Ui1pxJI
            VryJXuFnaZ1cjy8ej8UvJncC8bvVSWrkgOMy/9/3YMRvt2s=
-            ----END CERTIFICATE-----
        EOT -> (known after apply)
!       id                    = "295159832347200132970001197411202497174" -> (known after apply)
!       key_algorithm         = "RSA" -> (known after apply)
!       validity_end_time     = "2023-10-15T02:21:45.445399601Z" -> (known after apply)
!       validity_start_time   = "2022-10-15T02:21:45.445399601Z" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
